
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * azurerm_application_insights.appinsights
* Delete
  * module.application_insights.azurerm_application_insights.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_insights.appinsights will be created
  + resource "azurerm_application_insights" "appinsights" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "uksouth"
      + name                                  = "xui-mo-webapp-appinsights-aat"
      + resource_group_name                   = "xui-mo-webapp-aat"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + tags                                  = {
          + "application"         = "expert-ui"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/rpx-xui-manage-organisations.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#xui-pipeline"
          + "environment"         = "staging"
          + "managedBy"           = "Expert UI"
        }
    }

  # module.application_insights.azurerm_application_insights.this will be destroyed
  # (because azurerm_application_insights.this is not in configuration)
  - resource "azurerm_application_insights" "this" {
      - app_id                                = "3fcab30a-eeac-48ae-87e0-ac1881c9a034" -> null
      - application_type                      = "web" -> null
      - connection_string                     = (sensitive value) -> null
      - daily_data_cap_in_gb                  = 50 -> null
      - daily_data_cap_notifications_disabled = false -> null
      - disable_ip_masking                    = false -> null
      - force_customer_storage_for_profiler   = false -> null
      - id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/xui-mo-webapp-aat/providers/Microsoft.Insights/components/xui-mo-webapp-appinsights-aat" -> null
      - instrumentation_key                   = (sensitive value) -> null
      - internet_ingestion_enabled            = true -> null
      - internet_query_enabled                = true -> null
      - local_authentication_disabled         = false -> null
      - location                              = "uksouth" -> null
      - name                                  = "xui-mo-webapp-appinsights-aat" -> null
      - resource_group_name                   = "xui-mo-webapp-aat" -> null
      - retention_in_days                     = 90 -> null
      - sampling_percentage                   = 100 -> null
      - tags                                  = {
          - "application"         = "expert-ui"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/rpx-xui-manage-organisations.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#xui-pipeline"
          - "environment"         = "staging"
          - "managedBy"           = "Expert UI"
        } -> null
      - workspace_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod" -> null

      - timeouts {}
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1224,"Program":"tfcmt","SHA1":"","Vars":{}} -->